/* 声明 */

// 语法：声明说明符 声明符；
// 其中：
// 1. 声明说明符有三大类：
//      - 存储类型：四种auto、static、extern、register
//      - 类型限定符：const、volatile
//      - 类型说明符：void、char、short、int、long、float、double、signed、unsigned等，它们可以组合使用；包括结构、联合、枚举都是类型说明符。
//      - C99的函数说明符：只用于函数，比如内联函数inline
//
//    变量的性质：存储期限(局部自动分配、始终占有同一个存储单元)、作用域（块、文件）、链接（外部、内部）
//    auto: 只对属于块的变量有效。auto变量具有自动存储期限、块作用域，并且无链接。（不用明确指明）
//    static: 可以用于全部变量，而无需考虑变量声明的位置。对于块外部声明的变量，单词static说明变量具有内部链接（其他文件不可以使用此变量）；
//      用在块内部时，static把变量的存储期限从自动的变为了静态的。
//    extern: 使几个源文件可以共享同一个变量，具有外部链接。在文件a中声明一个变量x，在文件b中可以通过extern声明x，并不会再分配内存，而是告诉编译器此变量来自外部文件a
//    register: 要求编译器把变量存储在寄存器中，而不是放在内存中。但是这只是一种请求，而不是命令。另外寄存器是没有地址，所以不能对register变量使用&运算。
//
//    函数的存储类型：static、extern
//
//    类型限定符：const 、volatile、restrict 区分const与define区别
//    const: 是文档格式，声明对象是const类型可以提示任何阅读程序的人，该对象的值不会改变。
//    volatile: 强调每次使用变量时，必须从主内存中读取
//    restrict: 仅限于指针

// 2. 声明符:
//      - 标识符：如变量名称、函数名称
//      - 标识符前面可能有*，后边可能有[]或()
//
//    用*开头的声明符标识指针；**开头的标识指向指针的指针；
//    用[]结尾的声明符标识数组；
//    用()结尾的声明符标识函数；
//
//    解读声明符技巧：始终从内外外读声明符。先定位声明的标识符，并且从此处开始解释声明。在作选择时，始终使[]和（）优先与*。
//    int *arr[]; 从arr开始，[]优先于*，所以arr是一个数组，而后是一个指针，因此arr是一个存储int指针的数组。而不是数组指针。
//    float *fp(float): 从fp开始，（）优先于*，所以fp是一个函数，因此fp是返回指针的函数。
//    void (*pf)(int): 从pf开始，因为*pf在圆括号内，因此pf一定是一个指针；（*pf）后面是()，因此pf必须是指向函数的指针。此函数带int参数与void的返回值。

#include <stdio.h>

int main()
{

}

